In [39]:
import pandas as pd

In [41]:
df = pd.read_csv(r'C:\Users\balam\Downloads\weather_dataset\nyc_Jan_Jun_2016_weat.csv')
print(df)

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
0      20160101  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
1      20160102  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2      20160103  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
3      20160104  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
4      20160105  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...         ...       ...        ...     ...   ...     ...   ...   ...   ...
32202  20170709  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
32203  20170710  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
32204  20170711  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
32205  20170712  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
32206  20170713  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 9 columns]

In [42]:
df['LONGITUDE'].max()

np.float64(-73.3722)

In [43]:
df['DATE'][df['TMAX']== 82]

1016     20160419
1059     20160601
1061     20160603
1071     20160613
1082     20160624
           ...
31913    20160923
32118    20170416
32173    20170610
32198    20170705
32202    20170709
Name: DATE, Length: 126, dtype: int64

In [45]:
df['SNOW'].mean()

np.float64(-4263.479085292018)

In [46]:
df.shape

(32207, 9)

In [47]:
df.head()

       DATE  LATITUDE  LONGITUDE  SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
0  20160101   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
1  20160102   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
2  20160103   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
3  20160104   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
4  20160105   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999

In [48]:
df.head(3)

       DATE  LATITUDE  LONGITUDE  SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
0  20160101   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
1  20160102   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
2  20160103   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999

In [49]:
df.tail()

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
32202  20170709  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
32203  20170710  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
32204  20170711  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
32205  20170712  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
32206  20170713  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

In [50]:
df.tail(1)

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
32206  20170713  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

In [51]:
df[2:9]

       DATE  LATITUDE  LONGITUDE  SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
2  20160103   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
3  20160104   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
4  20160105   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
5  20160106   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
6  20160107   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
7  20160108   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
8  20160112   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999

In [52]:
df.columns

Index(['DATE', 'LATITUDE', 'LONGITUDE', 'SNOW', 'PRCP', 'SNWD', 'TAVG', 'TMAX',
       'TMIN'],
      dtype='object')

In [53]:
df.DATE

0        20160101
1        20160102
2        20160103
3        20160104
4        20160105
           ...
32202    20170709
32203    20170710
32204    20170711
32205    20170712
32206    20170713
Name: DATE, Length: 32207, dtype: int64

In [54]:
df['LATITUDE']

0        41.06390
1        41.06390
2        41.06390
3        41.06390
4        41.06390
           ...
32202    40.73417
32203    40.73417
32204    40.73417
32205    40.73417
32206    40.73417
Name: LATITUDE, Length: 32207, dtype: float64

In [55]:
type(df['SNOW'])

pandas.core.series.Series

In [56]:
df[['TAVG', 'TMAX']]

       TAVG  TMAX
0     -9999 -9999
1     -9999 -9999
2     -9999 -9999
3     -9999 -9999
4     -9999 -9999
...     ...   ...
32202 -9999    82
32203 -9999    81
32204 -9999    86
32205 -9999    90
32206 -9999    91

[32207 rows x 2 columns]

In [57]:
df.describe()

,DATE,LATITUDE,LONGITUDE,SNOW,PRCP,SNWD,TAVG,TMAX,TMIN
count,3.220700e+04,32207.000000,32207.000000,32207.000000,32207.000000,32207.000000,32207.000000,32207.000000,32207.000000
mean,2.016379e+07,40.758364,-74.115480,-4263.479085,-41.474001,-7452.434185,-9472.630453,-7806.498743,-7798.696184
std,4.553580e+03,0.210378,0.250133,4945.177190,643.636786,4356.649666,2239.591076,4153.806872,4154.587650
min,2.016010e+07,40.275400,-74.482700,-9999.000000,-9999.000000,-9999.000000,-9999.000000,-9999.000000,-9999.000000
25%,2.016051e+07,40.662300,-74.284700,-9999.000000,0.000000,-9999.000000,-9999.000000,-9999.000000,-9999.000000
50%,2.016092e+07,40.755600,-74.152300,0.000000,0.000000,-9999.000000,-9999.000000,-9999.000000,-9999.000000
75%,2.017021e+07,40.902700,-74.000200,0.000000,0.070000,0.000000,-9999.000000,-9999.000000,-9999.000000
max,2.017072e+07,41.083500,-73.372200,68.000000,17.760000,30.700000,91.000000,101.000000,84.000000

In [58]:
df[df.TMAX==81]

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
1058   20160531  40.89170  -74.39620     0.0  0.05     0.0 -9999    81    66
1100   20160712  40.89170  -74.39620     0.0  0.00     0.0 -9999    81    58
1444   20170624  40.89170  -74.39620     0.0  0.90     0.0 -9999    81    71
1446   20170626  40.89170  -74.39620     0.0  0.06     0.0 -9999    81    55
4574   20160614  40.77944  -73.88028     0.0  0.00     0.0    69    81    60
...         ...       ...        ...     ...   ...     ...   ...   ...   ...
31908  20160918  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    70
31910  20160920  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    69
32172  20170609  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    49
32186  20170623  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    71
32203  20170710  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64

[102 rows x 9 columns]

In [59]:
df[df.TMAX==df.TMAX.max()]

          DATE  LATITUDE  LONGITUDE  SNOW  PRCP  SNWD  TAVG  TMAX  TMIN
4938  20170613   40.7792     -73.88   0.0   0.0   0.0    90   101    80

In [60]:
df

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
0      20160101  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
1      20160102  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2      20160103  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
3      20160104  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
4      20160105  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...         ...       ...        ...     ...   ...     ...   ...   ...   ...
32202  20170709  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
32203  20170710  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
32204  20170711  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
32205  20170712  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
32206  20170713  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 9 columns]

In [61]:
df.index

RangeIndex(start=0, stop=32207, step=1)

In [68]:
df.set_index('TMAX', inplace=True)

In [76]:
df.reset_index(inplace=True)
df

       TMAX  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMIN
0     -9999  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999
1     -9999  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999
2     -9999  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999
3     -9999  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999
4     -9999  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999
...     ...       ...        ...     ...   ...     ...   ...   ...
32202    82  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    67
32203    81  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    64
32204    86  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    74
32205    90  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    74
32206    91  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    68

[32207 rows x 8 columns]

In [28]:
import pandas as pd
df = pd.read_csv(r'C:\Users\balam\Downloads\weather_dataset\nyc_Jan_Jun_2016_weat.csv')
print(df)

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
0      20160101  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
1      20160102  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2      20160103  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
3      20160104  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
4      20160105  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...         ...       ...        ...     ...   ...     ...   ...   ...   ...
32202  20170709  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
32203  20170710  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
32204  20170711  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
32205  20170712  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
32206  20170713  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 9 columns]

In [32]:
weather_data = {'DATE':[20160101,20160102,20160103],
                'LATITUDE':[41.0639,41.0639,41.0639],
                'LONGITUDE':[-73.7722,-73.7722,-73.7722],
                'SNOW':[0.0,0.0,0.0],
                'PRPC':[0.0,0.0,0.0],
                'SNWD':[-9999.0,-9999.0	,-9999.0	],
                'TAVG':[-9999,-9999,-9999],
                'TMAX':[-9999,-9999,-9999],
                'TMIN':[-9999,-9999,-9999]}
df = pd.DataFrame(weather_data)

print(df)

       DATE  LATITUDE  LONGITUDE  SNOW  PRPC    SNWD  TAVG  TMAX  TMIN
0  20160101   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
1  20160102   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999
2  20160103   41.0639   -73.7722   0.0   0.0 -9999.0 -9999 -9999 -9999

handle missing values

In [34]:
import pandas as pd
df = pd.read_csv(r"C:\Users\balam\Downloads\archive (1)\googleplaystore.csv")
print(df)

                                                     App             Category  \
0         Photo Editor & Candy Camera & Grid & ScrapBook       ART_AND_DESIGN
1                                    Coloring book moana       ART_AND_DESIGN
2      U Launcher Lite – FREE Live Cool Themes, Hide ...       ART_AND_DESIGN
3                                  Sketch - Draw & Paint       ART_AND_DESIGN
4                  Pixel Draw - Number Art Coloring Book       ART_AND_DESIGN
...                                                  ...                  ...
10836                                   Sya9a Maroc - FR               FAMILY
10837                   Fr. Mike Schmitz Audio Teachings               FAMILY
10838                             Parkinson Exercices FR              MEDICAL
10839                      The SCP Foundation DB fr nn5n  BOOKS_AND_REFERENCE
10840      iHoroscope - 2018 Daily Horoscope & Astrology            LIFESTYLE

       Rating Reviews                Size     Installs  Type Price  \
0         4.1     159                 19M      10,000+  Free     0
1         3.9     967                 14M     500,000+  Free     0
2         4.7   87510                8.7M   5,000,000+  Free     0
3         4.5  215644                 25M  50,000,000+  Free     0
4         4.3     967                2.8M     100,000+  Free     0
...       ...     ...                 ...          ...   ...   ...
10836     4.5      38                 53M       5,000+  Free     0
10837     5.0       4                3.6M         100+  Free     0
10838     NaN       3                9.5M       1,000+  Free     0
10839     4.5     114  Varies with device       1,000+  Free     0
10840     4.5  398307                 19M  10,000,000+  Free     0

      Content Rating                     Genres      Last Updated  \
0           Everyone               Art & Design   January 7, 2018
1           Everyone  Art & Design;Pretend Play  January 15, 2018
2           Everyone               Art & Design    August 1, 2018
3               Teen               Art & Design      June 8, 2018
4           Everyone    Art & Design;Creativity     June 20, 2018
...              ...                        ...               ...
10836       Everyone                  Education     July 25, 2017
10837       Everyone                  Education      July 6, 2018
10838       Everyone                    Medical  January 20, 2017
10839     Mature 17+          Books & Reference  January 19, 2015
10840       Everyone                  Lifestyle     July 25, 2018

              Current Ver         Android Ver
0                   1.0.0        4.0.3 and up
1                   2.0.0        4.0.3 and up
2                   1.2.4        4.0.3 and up
3      Varies with device          4.2 and up
4                     1.1          4.4 and up
...                   ...                 ...
10836                1.48          4.1 and up
10837                 1.0          4.1 and up
10838                 1.0          2.2 and up
10839  Varies with device  Varies with device
10840  Varies with device  Varies with device

[10841 rows x 13 columns]

In [35]:
df.columns

Index(['App', 'Category', 'Rating', 'Reviews', 'Size', 'Installs', 'Type',
       'Price', 'Content Rating', 'Genres', 'Last Updated', 'Current Ver',
       'Android Ver'],
      dtype='object')

In [36]:
df = pd.read_csv(r"C:\Users\balam\Downloads\archive (1)\googleplaystore.csv", skiprows=1)
print(df)

          Photo Editor & Candy Camera & Grid & ScrapBook       ART_AND_DESIGN  \
0                                    Coloring book moana       ART_AND_DESIGN
1      U Launcher Lite – FREE Live Cool Themes, Hide ...       ART_AND_DESIGN
2                                  Sketch - Draw & Paint       ART_AND_DESIGN
3                  Pixel Draw - Number Art Coloring Book       ART_AND_DESIGN
4                             Paper flowers instructions       ART_AND_DESIGN
...                                                  ...                  ...
10835                                   Sya9a Maroc - FR               FAMILY
10836                   Fr. Mike Schmitz Audio Teachings               FAMILY
10837                             Parkinson Exercices FR              MEDICAL
10838                      The SCP Foundation DB fr nn5n  BOOKS_AND_REFERENCE
10839      iHoroscope - 2018 Daily Horoscope & Astrology            LIFESTYLE

       4.1     159                 19M      10,000+  Free  0    Everyone  \
0      3.9     967                 14M     500,000+  Free  0    Everyone
1      4.7   87510                8.7M   5,000,000+  Free  0    Everyone
2      4.5  215644                 25M  50,000,000+  Free  0        Teen
3      4.3     967                2.8M     100,000+  Free  0    Everyone
4      4.4     167                5.6M      50,000+  Free  0    Everyone
...    ...     ...                 ...          ...   ... ..         ...
10835  4.5      38                 53M       5,000+  Free  0    Everyone
10836  5.0       4                3.6M         100+  Free  0    Everyone
10837  NaN       3                9.5M       1,000+  Free  0    Everyone
10838  4.5     114  Varies with device       1,000+  Free  0  Mature 17+
10839  4.5  398307                 19M  10,000,000+  Free  0    Everyone

                    Art & Design   January 7, 2018               1.0.0  \
0      Art & Design;Pretend Play  January 15, 2018               2.0.0
1                   Art & Design    August 1, 2018               1.2.4
2                   Art & Design      June 8, 2018  Varies with device
3        Art & Design;Creativity     June 20, 2018                 1.1
4                   Art & Design    March 26, 2017                 1.0
...                          ...               ...                 ...
10835                  Education     July 25, 2017                1.48
10836                  Education      July 6, 2018                 1.0
10837                    Medical  January 20, 2017                 1.0
10838          Books & Reference  January 19, 2015  Varies with device
10839                  Lifestyle     July 25, 2018  Varies with device

             4.0.3 and up
0            4.0.3 and up
1            4.0.3 and up
2              4.2 and up
3              4.4 and up
4              2.3 and up
...                   ...
10835          4.1 and up
10836          4.1 and up
10837          2.2 and up
10838  Varies with device
10839  Varies with device

[10840 rows x 13 columns]

In [45]:
f = pd.read_csv(r"C:\Users\balam\Downloads\archive (1)\googleplaystore.csv", header=None)
print(df)

          Photo Editor & Candy Camera & Grid & ScrapBook       ART_AND_DESIGN  \
0                                    Coloring book moana       ART_AND_DESIGN
1      U Launcher Lite – FREE Live Cool Themes, Hide ...       ART_AND_DESIGN
2                                  Sketch - Draw & Paint       ART_AND_DESIGN
3                  Pixel Draw - Number Art Coloring Book       ART_AND_DESIGN
4                             Paper flowers instructions       ART_AND_DESIGN
...                                                  ...                  ...
10835                                   Sya9a Maroc - FR               FAMILY
10836                   Fr. Mike Schmitz Audio Teachings               FAMILY
10837                             Parkinson Exercices FR              MEDICAL
10838                      The SCP Foundation DB fr nn5n  BOOKS_AND_REFERENCE
10839      iHoroscope - 2018 Daily Horoscope & Astrology            LIFESTYLE

       4.1     159                 19M      10,000+  Free  0    Everyone  \
0      3.9     967                 14M     500,000+  Free  0    Everyone
1      4.7   87510                8.7M   5,000,000+  Free  0    Everyone
2      4.5  215644                 25M  50,000,000+  Free  0        Teen
3      4.3     967                2.8M     100,000+  Free  0    Everyone
4      4.4     167                5.6M      50,000+  Free  0    Everyone
...    ...     ...                 ...          ...   ... ..         ...
10835  4.5      38                 53M       5,000+  Free  0    Everyone
10836  5.0       4                3.6M         100+  Free  0    Everyone
10837  NaN       3                9.5M       1,000+  Free  0    Everyone
10838  4.5     114  Varies with device       1,000+  Free  0  Mature 17+
10839  4.5  398307                 19M  10,000,000+  Free  0    Everyone

                    Art & Design   January 7, 2018               1.0.0  \
0      Art & Design;Pretend Play  January 15, 2018               2.0.0
1                   Art & Design    August 1, 2018               1.2.4
2                   Art & Design      June 8, 2018  Varies with device
3        Art & Design;Creativity     June 20, 2018                 1.1
4                   Art & Design    March 26, 2017                 1.0
...                          ...               ...                 ...
10835                  Education     July 25, 2017                1.48
10836                  Education      July 6, 2018                 1.0
10837                    Medical  January 20, 2017                 1.0
10838          Books & Reference  January 19, 2015  Varies with device
10839                  Lifestyle     July 25, 2018  Varies with device

             4.0.3 and up
0            4.0.3 and up
1            4.0.3 and up
2              4.2 and up
3              4.4 and up
4              2.3 and up
...                   ...
10835          4.1 and up
10836          4.1 and up
10837          2.2 and up
10838  Varies with device
10839  Varies with device

[10840 rows x 13 columns]

In [63]:
df = pd.read_csv(r"C:\Users\balam\Downloads\archive (1)\googleplaystore.csv", nrows=3)
print(df)

                                                 App        Category  Rating  \
0     Photo Editor & Candy Camera & Grid & ScrapBook  ART_AND_DESIGN     4.1
1                                Coloring book moana  ART_AND_DESIGN     3.9
2  U Launcher Lite – FREE Live Cool Themes, Hide ...  ART_AND_DESIGN     4.7

   Reviews  Size    Installs  Type  Price Content Rating  \
0      159   19M     10,000+  Free      0       Everyone
1      967   14M    500,000+  Free      0       Everyone
2    87510  8.7M  5,000,000+  Free      0       Everyone

                      Genres      Last Updated Current Ver   Android Ver
0               Art & Design   January 7, 2018       1.0.0  4.0.3 and up
1  Art & Design;Pretend Play  January 15, 2018       2.0.0  4.0.3 and up
2               Art & Design    August 1, 2018       1.2.4  4.0.3 and up

In [48]:
df.head(8)

,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
0,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
1,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
2,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
3,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
4,Paper flowers instructions,ART_AND_DESIGN,4.4,167,5.6M,"50,000+",Free,0,Everyone,Art & Design,"March 26, 2017",1.0,2.3 and up
5,Smoke Effect Photo Maker - Smoke Editor,ART_AND_DESIGN,3.8,178,19M,"50,000+",Free,0,Everyone,Art & Design,"April 26, 2018",1.1,4.0.3 and up
6,Infinite Painter,ART_AND_DESIGN,4.1,36815,29M,"1,000,000+",Free,0,Everyone,Art & Design,"June 14, 2018",6.1.61.1,4.2 and up
7,Garden Coloring Book,ART_AND_DESIGN,4.4,13791,33M,"1,000,000+",Free,0,Everyone,Art & Design,"September 20, 2017",2.9.2,3.0 and up

In [64]:
df.to_csv('newdata.csv')

In [65]:
df.to_csv("newdata.csv", index=['App'])

In [101]:
df = pd.read_csv(r'C:\Users\balam\Downloads\weather_dataset\nyc_Jan_Jun_2016_weat.csv')
type(df.DATE[0])

numpy.int64

In [102]:
df = pd.read_csv(r'C:\Users\balam\Downloads\weather_dataset\nyc_Jan_Jun_2016_weat.csv', parse_dates=["DATE"])
df.set_index('DATE',inplace=True)
print(df)

            LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
DATE
2016-01-01  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-02  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-03  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-04  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-05  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...              ...        ...     ...   ...     ...   ...   ...   ...
2017-07-09  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
2017-07-10  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
2017-07-11  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
2017-07-12  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
2017-07-13  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 8 columns]

In [104]:
new_df = df.fillna(0)
print(new_df)

            LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
DATE
2016-01-01  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-02  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-03  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-04  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-05  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...              ...        ...     ...   ...     ...   ...   ...   ...
2017-07-09  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
2017-07-10  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
2017-07-11  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
2017-07-12  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
2017-07-13  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 8 columns]

In [105]:
new_df = df.fillna(method = "ffill")
print(new_df)

            LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
DATE
2016-01-01  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-02  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-03  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-04  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-05  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...              ...        ...     ...   ...     ...   ...   ...   ...
2017-07-09  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
2017-07-10  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
2017-07-11  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
2017-07-12  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
2017-07-13  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 8 columns]

C:\Users\balam\AppData\Local\Temp\ipykernel_5684\3749249164.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method = "ffill")

In [106]:
new_df = df.interpolate()
print(new_df)

            LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
DATE
2016-01-01  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-02  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-03  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-04  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-05  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...              ...        ...     ...   ...     ...   ...   ...   ...
2017-07-09  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
2017-07-10  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
2017-07-11  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
2017-07-12  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
2017-07-13  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 8 columns]

In [108]:
new_df = df.interpolate(method='time')
print(new_df)

            LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
DATE
2016-01-01  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-02  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-03  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-04  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-05  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...              ...        ...     ...   ...     ...   ...   ...   ...
2017-07-09  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
2017-07-10  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
2017-07-11  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
2017-07-12  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
2017-07-13  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 8 columns]

In [111]:
new_df = df.dropna(thresh=1)
print(new_df)

            LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
DATE
2016-01-01  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-02  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-03  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-04  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2016-01-05  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...              ...        ...     ...   ...     ...   ...   ...   ...
2017-07-09  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
2017-07-10  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
2017-07-11  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
2017-07-12  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
2017-07-13  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 8 columns]

REPLACE FUNCTION

In [112]:
import pandas as pd
import numpy as np
df = pd.read_csv(r'C:\Users\balam\Downloads\weather_dataset\nyc_Jan_Jun_2016_weat.csv')
print(df)

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
0      20160101  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
1      20160102  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2      20160103  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
3      20160104  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
4      20160105  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...         ...       ...        ...     ...   ...     ...   ...   ...   ...
32202  20170709  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
32203  20170710  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
32204  20170711  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
32205  20170712  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
32206  20170713  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 9 columns]

In [120]:
new_df = df.replace([-73.41694,81], np.nan)
print(new_df)

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD    TAVG    TMAX  \
0      20160101  41.06390   -73.7722     0.0  0.00 -9999.0 -9999.0 -9999.0
1      20160102  41.06390   -73.7722     0.0  0.00 -9999.0 -9999.0 -9999.0
2      20160103  41.06390   -73.7722     0.0  0.00 -9999.0 -9999.0 -9999.0
3      20160104  41.06390   -73.7722     0.0  0.00 -9999.0 -9999.0 -9999.0
4      20160105  41.06390   -73.7722     0.0  0.00 -9999.0 -9999.0 -9999.0
...         ...       ...        ...     ...   ...     ...     ...     ...
32202  20170709  40.73417        NaN -9999.0  0.00 -9999.0 -9999.0    82.0
32203  20170710  40.73417        NaN -9999.0  0.00 -9999.0 -9999.0     NaN
32204  20170711  40.73417        NaN -9999.0  0.06 -9999.0 -9999.0    86.0
32205  20170712  40.73417        NaN -9999.0  0.00 -9999.0 -9999.0    90.0
32206  20170713  40.73417        NaN -9999.0  0.01 -9999.0 -9999.0    91.0

         TMIN
0     -9999.0
1     -9999.0
2     -9999.0
3     -9999.0
4     -9999.0
...       ...
32202    67.0
32203    64.0
32204    74.0
32205    74.0
32206    68.0

[32207 rows x 9 columns]

In [121]:
new_df = df.replace('[A-Za-z]','', regex =True)
print(new_df)

           DATE  LATITUDE  LONGITUDE    SNOW  PRCP    SNWD  TAVG  TMAX  TMIN
0      20160101  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
1      20160102  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
2      20160103  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
3      20160104  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
4      20160105  41.06390  -73.77220     0.0  0.00 -9999.0 -9999 -9999 -9999
...         ...       ...        ...     ...   ...     ...   ...   ...   ...
32202  20170709  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    82    67
32203  20170710  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    81    64
32204  20170711  40.73417  -73.41694 -9999.0  0.06 -9999.0 -9999    86    74
32205  20170712  40.73417  -73.41694 -9999.0  0.00 -9999.0 -9999    90    74
32206  20170713  40.73417  -73.41694 -9999.0  0.01 -9999.0 -9999    91    68

[32207 rows x 9 columns]

GROUP BY

In [123]:
import pandas  as pd
df = pd.read_csv(r"C:\Users\balam\Downloads\archive (2)\Temperature_And_Precipitation_Cities_IN\Station_GeoLocation_Longitute_Latitude_Elevation_EPSG_4326.csv")
df

   longitude  Latitude  Elevation Location_Name
0    73.0167   26.3000      217.0     Bangalore
1    80.2500   13.0667        6.0       Chennai
2    77.2000   28.5833      211.0         Delhi
3    80.9330   26.8667      110.0       Lucknow
4    72.8500   19.1167        8.0        Mumbai
5    77.5833   12.9667      920.0      Rajastan
6    85.8333   20.2500        NaN   Bubhneshwar
7    84.8833   22.2167        NaN      Rourkela

In [124]:
d = df.groupby('Location_Name')
d

In [125]:
for Location_Name, Location_Name_df in d:
    print(Location_Name)
    print(Location_Name_df)

Bangalore
   longitude  Latitude  Elevation Location_Name
0    73.0167      26.3      217.0     Bangalore
Bubhneshwar
   longitude  Latitude  Elevation Location_Name
6    85.8333     20.25        NaN   Bubhneshwar
Chennai
   longitude  Latitude  Elevation Location_Name
1      80.25   13.0667        6.0       Chennai
Delhi
   longitude  Latitude  Elevation Location_Name
2       77.2   28.5833      211.0         Delhi
Lucknow
   longitude  Latitude  Elevation Location_Name
3     80.933   26.8667      110.0       Lucknow
Mumbai
   longitude  Latitude  Elevation Location_Name
4      72.85   19.1167        8.0        Mumbai
Rajastan
   longitude  Latitude  Elevation Location_Name
5    77.5833   12.9667      920.0      Rajastan
Rourkela
   longitude  Latitude  Elevation Location_Name
7    84.8833   22.2167        NaN      Rourkela

In [126]:
d.max()

               longitude  Latitude  Elevation
Location_Name
Bangalore        73.0167   26.3000      217.0
Bubhneshwar      85.8333   20.2500        NaN
Chennai          80.2500   13.0667        6.0
Delhi            77.2000   28.5833      211.0
Lucknow          80.9330   26.8667      110.0
Mumbai           72.8500   19.1167        8.0
Rajastan         77.5833   12.9667      920.0
Rourkela         84.8833   22.2167        NaN

In [127]:
d.mean()

               longitude  Latitude  Elevation
Location_Name
Bangalore        73.0167   26.3000      217.0
Bubhneshwar      85.8333   20.2500        NaN
Chennai          80.2500   13.0667        6.0
Delhi            77.2000   28.5833      211.0
Lucknow          80.9330   26.8667      110.0
Mumbai           72.8500   19.1167        8.0
Rajastan         77.5833   12.9667      920.0
Rourkela         84.8833   22.2167        NaN

In [134]:
%matplotlib_inline
d.plot()

UsageError: Line magic function `%matplotlib_inline` not found.

CONCATENATION DATAFRAME

In [141]:
import pandas as pd
india_weather = pd.DataFrame({"city":["uthrapradesh", "andhrapradesh", "bangladesh"],
                              "temperature":[32,43,42],
                              "humidity":[80,60,78]})
india_weather

            city  temperature  humidity
0   uthrapradesh           32        80
1  andhrapradesh           43        60
2     bangladesh           42        78

In [142]:
import pandas as pd
tamil_weather = pd.DataFrame({"city":["mumbai", "chennai", "gujarat"],
                              "temperature":[28,38,42],
                              "humidity":[75,50,68]})
tamil_weather

      city  temperature  humidity
0   mumbai           28        75
1  chennai           38        50
2  gujarat           42        68

In [143]:
df = pd.concat([india_weather,tamil_weather])
df

            city  temperature  humidity
0   uthrapradesh           32        80
1  andhrapradesh           43        60
2     bangladesh           42        78
0         mumbai           28        75
1        chennai           38        50
2        gujarat           42        68

In [144]:
df = pd.concat([india_weather,tamil_weather], ignore_index=True)
df

            city  temperature  humidity
0   uthrapradesh           32        80
1  andhrapradesh           43        60
2     bangladesh           42        78
3         mumbai           28        75
4        chennai           38        50
5        gujarat           42        68

In [146]:
df = pd.concat([india_weather,tamil_weather], keys=['india', 'tamil'])
df

                  city  temperature  humidity
india 0   uthrapradesh           32        80
      1  andhrapradesh           43        60
      2     bangladesh           42        78
tamil 0         mumbai           28        75
      1        chennai           38        50
      2        gujarat           42        68

In [147]:
df.loc['tamil']

      city  temperature  humidity
0   mumbai           28        75
1  chennai           38        50
2  gujarat           42        68

In [148]:
df.loc['india']

            city  temperature  humidity
0   uthrapradesh           32        80
1  andhrapradesh           43        60
2     bangladesh           42        78

In [149]:
temp_df = pd.DataFrame({"city":["uthrapradesh", "andhrapradesh", "bangladesh"],
                              "temperature":[32,43,42]})
temp_df

            city  temperature
0   uthrapradesh           32
1  andhrapradesh           43
2     bangladesh           42

In [150]:
humidity_df = pd.DataFrame({"city":["mumbai", "chennai", "gujarat"],
                            "humidity":[75,50,68]})
humidity_df

      city  humidity
0   mumbai        75
1  chennai        50
2  gujarat        68

In [151]:
df = pd.concat([temp_df,humidity_df])
df

            city  temperature  humidity
0   uthrapradesh         32.0       NaN
1  andhrapradesh         43.0       NaN
2     bangladesh         42.0       NaN
0         mumbai          NaN      75.0
1        chennai          NaN      50.0
2        gujarat          NaN      68.0

In [152]:
df = pd.concat([temp_df,humidity_df], axis=1)
df

            city  temperature     city  humidity
0   uthrapradesh           32   mumbai        75
1  andhrapradesh           43  chennai        50
2     bangladesh           42  gujarat        68

In [153]:
temp_df

            city  temperature
0   uthrapradesh           32
1  andhrapradesh           43
2     bangladesh           42

In [156]:
s = pd.Series(["rain","sunny","dry"], name="event")
s

0     rain
1    sunny
2      dry
Name: event, dtype: object

In [158]:
a = pd.concat([temp_df,s], axis=1)
a

            city  temperature  event
0   uthrapradesh           32   rain
1  andhrapradesh           43  sunny
2     bangladesh           42    dry

In [159]:
us1 = pd.DataFrame({"city":["usa", "egypt", "asia"],
                            "humidity":[45,50,55]})
us1

    city  humidity
0    usa        45
1  egypt        50
2   asia        55

In [160]:
us2 = pd.DataFrame({"city":["usa", "egypt", "asia"],
                    'temperature':[12,25,18]})
us2

    city  temperature
0    usa           12
1  egypt           25
2   asia           18

In [163]:
us3 = pd.merge(us1,us2, on="city")
us3

    city  humidity  temperature
0    usa        45           12
1  egypt        50           25
2   asia        55           18

In [164]:
us1 = pd.DataFrame({"city":["usa", "egypt", "asia","kanadda"],
                            "humidity":[45,50,55,44]})
us1

      city  humidity
0      usa        45
1    egypt        50
2     asia        55
3  kanadda        44

In [165]:
us2 = pd.DataFrame({"city":["usa", "egypt", "france"],
                    'temperature':[12,25,18]})
us2

     city  temperature
0     usa           12
1   egypt           25
2  france           18

In [166]:
b = pd.merge(us1,us2,how="inner")
b

    city  humidity  temperature
0    usa        45           12
1  egypt        50           25

In [167]:
b = pd.merge(us1,us2,how="outer")
b

      city  humidity  temperature
0     asia      55.0          NaN
1    egypt      50.0         25.0
2   france       NaN         18.0
3  kanadda      44.0          NaN
4      usa      45.0         12.0

In [168]:
b = pd.merge(us1,us2,how="right")
b

     city  humidity  temperature
0     usa      45.0           12
1   egypt      50.0           25
2  france       NaN           18

In [169]:
b = pd.merge(us1,us2,how="left")
b

      city  humidity  temperature
0      usa        45         12.0
1    egypt        50         25.0
2     asia        55          NaN
3  kanadda        44          NaN

In [170]:
b = pd.merge(us1,us2,how="outer", indicator=True)
b

      city  humidity  temperature      _merge
0     asia      55.0          NaN   left_only
1    egypt      50.0         25.0        both
2   france       NaN         18.0  right_only
3  kanadda      44.0          NaN   left_only
4      usa      45.0         12.0        both

PIVOT table

In [171]:
import pandas  as pd
df = pd.read_csv(r"C:\Users\balam\Downloads\archive (2)\Temperature_And_Precipitation_Cities_IN\Station_GeoLocation_Longitute_Latitude_Elevation_EPSG_4326.csv")
df

   longitude  Latitude  Elevation Location_Name
0    73.0167   26.3000      217.0     Bangalore
1    80.2500   13.0667        6.0       Chennai
2    77.2000   28.5833      211.0         Delhi
3    80.9330   26.8667      110.0       Lucknow
4    72.8500   19.1167        8.0        Mumbai
5    77.5833   12.9667      920.0      Rajastan
6    85.8333   20.2500        NaN   Bubhneshwar
7    84.8833   22.2167        NaN      Rourkela

In [173]:
df.pivot(index="Elevation", columns="Location_Name", values="longitude")

Location_Name,Bangalore,Bubhneshwar,Chennai,Delhi,Lucknow,Mumbai,Rajastan,Rourkela
Elevation,,,,,,,,
NaN,NaN,85.8333,NaN,NaN,NaN,NaN,NaN,84.8833
6.0,NaN,NaN,80.25,NaN,NaN,NaN,NaN,NaN
8.0,NaN,NaN,NaN,NaN,NaN,72.85,NaN,NaN
110.0,NaN,NaN,NaN,NaN,80.933,NaN,NaN,NaN
211.0,NaN,NaN,NaN,77.2,NaN,NaN,NaN,NaN
217.0,73.0167,NaN,NaN,NaN,NaN,NaN,NaN,NaN
920.0,NaN,NaN,NaN,NaN,NaN,NaN,77.5833,NaN

In [180]:
df.pivot_table(index="Location_Name", columns="Elevation", aggfunc="mean")

              Latitude                                           longitude  \
Elevation        6.0      8.0      110.0    211.0 217.0    920.0     6.0
Location_Name
Bangalore          NaN      NaN      NaN      NaN  26.3      NaN       NaN
Chennai        13.0667      NaN      NaN      NaN   NaN      NaN     80.25
Delhi              NaN      NaN      NaN  28.5833   NaN      NaN       NaN
Lucknow            NaN      NaN  26.8667      NaN   NaN      NaN       NaN
Mumbai             NaN  19.1167      NaN      NaN   NaN      NaN       NaN
Rajastan           NaN      NaN      NaN      NaN   NaN  12.9667       NaN


Elevation      8.0     110.0 211.0    217.0    920.0
Location_Name
Bangalore        NaN     NaN   NaN  73.0167      NaN
Chennai          NaN     NaN   NaN      NaN      NaN
Delhi            NaN     NaN  77.2      NaN      NaN
Lucknow          NaN  80.933   NaN      NaN      NaN
Mumbai         72.85     NaN   NaN      NaN      NaN
Rajastan         NaN     NaN   NaN      NaN  77.5833

In [181]:
df.pivot_table(index="Location_Name", columns="Elevation", margins=True)

              Latitude                                                       \
Elevation          6.0      8.0    110.0    211.0 217.0    920.0        All
Location_Name
Bangalore          NaN      NaN      NaN      NaN  26.3      NaN  26.300000
Chennai        13.0667      NaN      NaN      NaN   NaN      NaN  13.066700
Delhi              NaN      NaN      NaN  28.5833   NaN      NaN  28.583300
Lucknow            NaN      NaN  26.8667      NaN   NaN      NaN  26.866700
Mumbai             NaN  19.1167      NaN      NaN   NaN      NaN  19.116700
Rajastan           NaN      NaN      NaN      NaN   NaN  12.9667  12.966700
All            13.0667  19.1167  26.8667  28.5833  26.3  12.9667  21.150017

              longitude
Elevation           6.0    8.0   110.0 211.0    217.0    920.0        All
Location_Name
Bangalore           NaN    NaN     NaN   NaN  73.0167      NaN  73.016700
Chennai           80.25    NaN     NaN   NaN      NaN      NaN  80.250000
Delhi               NaN    NaN     NaN  77.2      NaN      NaN  77.200000
Lucknow             NaN    NaN  80.933   NaN      NaN      NaN  80.933000
Mumbai              NaN  72.85     NaN   NaN      NaN      NaN  72.850000
Rajastan            NaN    NaN     NaN   NaN      NaN  77.5833  77.583300
All               80.25  72.85  80.933  77.2  73.0167  77.5833  76.972167